In [2]:
import pandas as pd

In [2]:
import requests

# URL of the dataset
url = "https://www.data.gov.in/files/ogdpv2dms/s3fs-public/dataurl28062016/rs_session-237_AU2793_1.1.csv"

# Send a GET request to download the content
response = requests.get(url)

# Save the file to the local system
with open("dataset.csv", "wb") as file:
    file.write(response.content)

print("Dataset downloaded successfully.")

Dataset downloaded successfully.

In [29]:
df = pd.read_csv("dataset2.csv")

In [30]:
df.columns

Index(['S.No.', 'Towns', 'Zone', 'Zone Factor, Z', 'Default_Rate',
       'Avg_Income', 'Unemployment_Rate', 'Economic_Growth'],
      dtype='object')

In [31]:
df['Zone Factor, Z'].unique()

array([0.16, 0.1 , 0.24, 0.36])

In [32]:
df.head(150)

,S.No.,Towns,Zone,"Zone Factor, Z",Default_Rate,Avg_Income,Unemployment_Rate,Economic_Growth
0,1,Agra,III,0.16,0.187203,53612.595290,2.165208,1.657414
1,2,Ahmadabad,III,0.16,0.228797,36154.081632,8.067029,1.276872
2,3,Ajmer,II,0.10,0.200691,72637.450576,4.560137,2.507993
3,4,Allahabad,II,0.10,0.186221,47356.268931,5.067711,2.310591
4,5,Almora,IV,0.24,0.155914,67320.433624,6.706537,3.280703
...,...,...,...,...,...,...,...,...
102,103,Vadodara,III,0.16,0.233799,69833.564652,5.364316,1.814772
103,104,Varanasi,II,0.10,0.290547,74516.947370,6.458950,4.193809
104,105,Vellore,IV,0.24,0.112188,35844.849220,8.884409,3.451527
105,106,Vijaywada,III,0.16,0.194039,58153.910155,7.816354,5.947049
106,107,Vishakhapatnam,IV,0.24,0.198010,38166.118837,4.162623,1.326521

In [33]:
df = df.drop(columns=["Zone", "Zone Factor, Z"])

In [35]:
df.head()

,S.No.,Towns,Default_Rate,Avg_Income,Unemployment_Rate,Economic_Growth
0,1,Agra,0.187203,53612.595290,2.165208,1.657414
1,2,Ahmadabad,0.228797,36154.081632,8.067029,1.276872
2,3,Ajmer,0.200691,72637.450576,4.560137,2.507993
3,4,Allahabad,0.186221,47356.268931,5.067711,2.310591
4,5,Almora,0.155914,67320.433624,6.706537,3.280703

In [36]:
df.columns

Index(['S.No.', 'Towns', 'Default_Rate', 'Avg_Income', 'Unemployment_Rate',
       'Economic_Growth'],
      dtype='object')

In [37]:
def calculate_credit_risk(default_rate, avg_income, unemployment_rate, economic_growth, 
                          W1=0.4, W2=0.3, W3=0.2, W4=0.1):
    risk_score = (
        W1 * default_rate + 
        W2 * (1 / avg_income) + 
        W3 * unemployment_rate + 
        W4 * (1 / economic_growth)
    )
    return risk_score

In [39]:
df['Credit_Risk'] = df.apply(
    lambda row: calculate_credit_risk(row['Default_Rate'], row['Avg_Income'], 
                                      row['Unemployment_Rate'], row['Economic_Growth']), axis=1
)

In [41]:
print(df.head())

   S.No.      Towns  Default_Rate    Avg_Income  Unemployment_Rate  \
0      1       Agra      0.187203  53612.595290           2.165208
1      2  Ahmadabad      0.228797  36154.081632           8.067029
2      3      Ajmer      0.200691  72637.450576           4.560137
3      4  Allahabad      0.186221  47356.268931           5.067711
4      5     Almora      0.155914  67320.433624           6.706537

   Economic_Growth  Credit_Risk
0         1.657414     0.568264
1         1.276872     1.783249
2         2.507993     1.032180
3         2.310591     1.131316
4         3.280703     1.434159

In [42]:
df["Credit_Risk"].unique

<bound method Series.unique of 0      0.568264
1      1.783249
2      1.032180
3      1.131316
4      1.434159
         ...
102    1.221490
103    1.431858
104    1.850738
105    1.657707
106    0.987122
Name: Credit_Risk, Length: 107, dtype: float64>

In [43]:
df.to_csv('city_wise_risk_data.csv', index=False)

SyntaxError: invalid syntax (2142805291.py, line 1)